#Дано три цілих числа. Визначте, скільки з них збігаються. Програма повинна вивести одне з чисел: 3 (якщо всі збігаються), 2 (якщо два збігаються) або 0 (якщо всі числа є різними).

a = int(input("Введіть перше число: "))
b = int(input("Введіть друге число: "))
c = int(input("Введіть третє число: ")) 
if a == b: 
    if b == c: 
        print(3)  
    else: 
        print(2) 
else: 
    if a == c: 
        print(2) 
    else: 
        if b == c: 
            print(2) 
        else: 
            print(0)
