#14. За введеними координатами з’ясувати, до якої координатної чверті належить точка.

x = float(input("Введіть координату x: "))
y = float(input("Введіть координату y: "))

if x > 0 and y > 0:
    print("Точка належить до I чверті.")
elif x < 0 and y > 0:
    print("Точка належить до II чверті.")
elif x < 0 and y < 0:
    print("Точка належить до III чверті.")
elif x > 0 and y < 0:
    print("Точка належить до IV чверті.")
elif x == 0 and y == 0:
    print("Точка знаходиться на початку координат.")
elif x == 0:
    print("Точка знаходиться на осі Y.")
elif y == 0:
    print("Точка знаходиться на осі X.")
