#Скласти програму, яка за введеною кількістю прожитих років визначить одну з таких категорій населення: 
# ще не школяр — до 6 років;
#початкова школа — 6 –9 років;
#середня школа — 10–15 років;
#старша школа — 16 –17 років;
#вже не школяр — понад 17 років


age = int(input("Введіть вік людини: "))

if age < 6: 
    print("ще не школяр")
elif 5 < age < 10: 
    print("початкова школа")
elif 9 < age < 16: 
    print("середня школа")
elif 15 < age < 18: 
    print("старша школа")
elif age > 17: 
    print("вже не школяр")
