#Визначити, у якій валюті слід зробити банківський внесок у розмірі 25 000 грн, щоб через рік отримати максимальну суму у гривнях. Відомо, що у гривнях відсоток річних дорівнює 11,5 %, а у доларах — 4 %. На момент вкладу курс на купівлю становить 27 грн, а за рік курс продажу долара прогнозується 28,6. Розробити алгоритм і програму визначення, у якій валюті вигідно зробити внесок.

f_vnesok = 25000
v_year = 0.115
v_year_d = 0.04
kupivlya_d = 27
prodazh_d = 28.6

vnesok_grn_n = f_vnesok * (1 + v_year)


vklad_usd = f_vnesok / kupivlya_d
vnesok_usd_n= vklad_usd * (1 + v_year_d)
suma_grn_dol = vnesok_usd_n * prodazh_d


print(f"Внесок у гривнях:")
print(f"Початкова сума: {f_vnesok} грн")
print(f"Відсоткова ставка: {v_year * 100}%")
print(f"Сума через рік: {vnesok_usd_n:.2f} грн\n")

print(f"Внесок у доларах:")
print(f"Початкова сума: {f_vnesok} грн")
print(f"Курс купівлі долара: {kupivlya_d} грн")
print(f"Сума у доларах після конвертації: {vklad_usd:.2f} дол.")
print(f"Відсоткова ставка у доларах: {v_year_d * 100}%")
print(f"Сума у доларах через рік: {vnesok_usd_n:.2f} дол.")
print(f"Прогнозований курс продажу долара: {prodazh_d} грн")
print(f"Сума у гривнях через рік після конвертації: {suma_grn_dol:.2f} грн\n")


if vnesok_grn_n > suma_grn_dol:
    print(f" Внесок вигідніше зробити у гривнях.  У результаті ви отримаєте: {vnesok_grn_n:.2f} грн.")
else:
    print(f" Внесок вигідніше зробити у доларах. У результаті ви отримаєте: {suma_grn_dol:.2f} грн.")
