#Нехай задано числа a, b і с - довжина сторін трикутника. Якщо не можна побудувати трикутник із таким набором значень сторін, то надрукувати «Трикутник не існує», інакше –в залежності від того, який це трикутник надрукувати рівносторонній, рівнобедрений або який-небудь інший.

a = float(input("Введіть довжину сторони a: "))
b = float(input("Введіть довжину сторони b: "))
c = float(input("Введіть довжину сторони c: "))

if a + b > c and a + c > b and b + c > a:
    if a == b == c:
        print("Рівносторонній трикутник.")
    elif a == b or a == c or b == c:
        print("Рівнобедренний трикутник.")
    else:
        print("Різносторонній трикутник.")
else:
    print("Трикутник не існує.")
